function fifthtask() {
    var a, b, c;//коренні рівняння
    var D;//дискрімнант
    a = prompt("Введіть будь-ласка значення a",'');
    b = prompt("Введіть будь-ласка значення b",'');
    c = prompt("Введіть будь-ласка значення c",'');

    D = Math.pow(b,2) - 4 * a * c;
    if (D > 0) {
        var x1, x2;
        x1 = (-b - Math.sqrt(D)) / (2 * a);
        x2 = (-b + Math.sqrt(D)) / (2 * a);
        alert("Корені рівняння: x1 = " + x1 + ", x2 = " + x2);
    }
    else if (D === 0) {
        $x = -b / (2 * a);
        alert("Рівняння має один дійсний корень: x = " + $x);
    }
    else {
        alert("Рівняння не має дійсних коренів!");
    }
}